In [7]:
import pandas as pd

In [12]:
#Q1
data = {
    ('Sales', 'Online'): [1000, 1200, 1300, 1100, 1400, 1600, 1500, 1450],
    ('Sales', 'In-Store'): [900, 1100, 1000, 1050, 1150, 1350, 1250, 1200],
    ('Expenses', 'Online'): [500, 600, 550, 570, 590, 620, 610, 615],
    ('Expenses', 'In-Store'): [450, 490, 470, 480, 510, 540, 530, 525]
}

index = pd.MultiIndex.from_product([[2021, 2022], ['Q1', 'Q2', 'Q3', 'Q4']], names=['Year', 'Quarter'])
df = pd.DataFrame(data, index=index)
df

              Sales          Expenses
             Online In-Store   Online In-Store
Year Quarter
2021 Q1        1000      900      500      450
     Q2        1200     1100      600      490
     Q3        1300     1000      550      470
     Q4        1100     1050      570      480
2022 Q1        1400     1150      590      510
     Q2        1600     1350      620      540
     Q3        1500     1250      610      530
     Q4        1450     1200      615      525

In [13]:
df.loc[(2022, 'Q1'), ('Sales', 'Online')]

1400

In [14]:
df.loc[(2021, 'Q3'), ('Expenses', 'In-Store')]

470

In [15]:
df.loc[(2021, 'Q4'), 'Sales'].sum()

2150

In [16]:
df.loc[2022, ('Expenses', 'Online')].sum()

2435

In [17]:
df.loc[(2021, 'Q2'), 'Sales']

Online      1200
In-Store    1100
Name: (2021, Q2), dtype: int64

In [20]:
df.loc[2022, 'Expenses'].max()

Online      620
In-Store    540
dtype: int64

In [26]:

data = {
    'Store': ['Store A', 'Store B', 'Store A', 'Store B'],
    'Product': ['Product 1', 'Product 1', 'Product 2', 'Product 2'],
    'Sales': [200, 150, 300, 250]
}
df1 = pd.DataFrame(data).set_index(['Store', 'Product'])
df1

                   Sales
Store   Product
Store A Product 1    200
Store B Product 1    150
Store A Product 2    300
Store B Product 2    250

In [28]:
#2
df11=df1.stack()
df11

Store    Product
Store A  Product 1  Sales    200
Store B  Product 1  Sales    150
Store A  Product 2  Sales    300
Store B  Product 2  Sales    250
dtype: int64

In [66]:
#3
df11.unstack(level=0)

Store            Store A  Store B
Product
Product 1 Sales      200      150
Product 2 Sales      300      250

In [50]:
#5
data = pd.DataFrame({
    'Department': ['HR', 'HR', 'IT', 'IT'],
    'Role': ['Manager', 'Analyst', 'Manager', 'Analyst'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David']
}).set_index(['Department', 'Role'])
data

                   Employee
Department Role
HR         Manager    Alice
           Analyst      Bob
IT         Manager  Charlie
           Analyst    David

In [51]:
#6
data.loc['HR']

        Employee
Role
Manager    Alice
Analyst      Bob

In [52]:
#6
data.loc['IT']

        Employee
Role
Manager  Charlie
Analyst    David

In [45]:
grades = pd.DataFrame({
    'Student': ['John', 'Alice', 'Bob', 'Charlie'],
    'Subject': ['Math', 'Math', 'Science', 'Science'],
    'Grade': [88, 92, 85, 90]
})
grades

   Student  Subject  Grade
0     John     Math     88
1    Alice     Math     92
2      Bob  Science     85
3  Charlie  Science     90

In [53]:
#6
sort=grades.sort_values(by=['Grade'])
sort

   Student  Subject  Grade
2      Bob  Science     85
0     John     Math     88
3  Charlie  Science     90
1    Alice     Math     92

In [55]:
#7
sort.reset_index(drop=True)

   Student  Subject  Grade
0      Bob  Science     85
1     John     Math     88
2  Charlie  Science     90
3    Alice     Math     92

In [58]:
#8
ddata = pd.DataFrame({
    'Date': pd.date_range(start='2022-01-01', periods=5, freq='D'),
    'Temperature': [22, 21, 20, 19, 18]
}).set_index('Date')
ddata

            Temperature
Date
2022-01-01           22
2022-01-02           21
2022-01-03           20
2022-01-04           19
2022-01-05           18

In [61]:
dataa = pd.DataFrame({
    ('Category', 'A'): [100, 150],
    ('Category', 'B'): [200, 250]
}, index=['Store 1', 'Store 2'])

dataa

        Category
               A    B
Store 1      100  200
Store 2      150  250

In [63]:
#9

Index([('Category', 'A'), ('Category', 'B')], dtype='object')

In [64]:
#10
dataa.mean(axis=1)

Store 1    150.0
Store 2    200.0
dtype: float64